In [13]:
import pandas as pd
# pd is context  manager

In [14]:
a = [4,5,6]
myvar = pd.Series(a)
print(myvar)

0    4
1    5
2    6
dtype: int64

In [15]:
a = [4,5,6]
myvar = pd.Series(a,index = ["x","y","z"])
print(myvar)

x    4
y    5
z    6
dtype: int64

In [16]:
print(myvar["y"])

5

In [17]:
print(myvar[1])

5

C:\Users\HP\AppData\Local\Temp\ipykernel_17224\2320585734.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(myvar[1])

In [18]:
calories = {"day1":420,"day2":380,"day3":390}

myvar = pd.Series(calories)
print(myvar)

day1    420
day2    380
day3    390
dtype: int64

In [19]:
#every key will be an index position
print(myvar['day2'])

380

In [20]:
print(myvar[1])

380

C:\Users\HP\AppData\Local\Temp\ipykernel_17224\2320585734.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  print(myvar[1])

In [21]:
calories = {"day1":420,"day2":380,"day3":390}

myvar = pd.Series(calories,index=["day1","day2","day4"])
print(myvar)

day1    420.0
day2    380.0
day4      NaN
dtype: float64

## Dataframe:2D

In [22]:
data = {
    "calories":[420,380,390],
    "duration":[50,40,45]
    }
df = pd.DataFrame(data)
print(df)
df.shape

   calories  duration
0       420        50
1       380        40
2       390        45

(3, 2)

In [23]:
data = {
    "calories":[420,380,390],
    "duration":[50,40,45]
    }
df = pd.DataFrame(data,index=["day1","day2","day3"])
print(df)
df.shape

      calories  duration
day1       420        50
day2       380        40
day3       390        45

(3, 2)

In [24]:
# calories = {"day1":420,"day2":380,"day3":390}
# df = pd.DataFrame(calories)
# df

In [25]:
calories = {"day1":420,"day2":380,"day3":390}
df = pd.DataFrame(calories,index=[1])
df

   day1  day2  day3
1   420   380   390

In [26]:
# list into dataframe

lst = ["My","name","is","nikhil","garg"]

df = pd.DataFrame(lst)
df

        0
0      My
1    name
2      is
3  nikhil
4    garg

In [27]:
# list into dataframe

lst = ["My","name","is","nikhil","garg"]

df = pd.DataFrame(lst,columns=["details"])
df

  details
0      My
1    name
2      is
3  nikhil
4    garg

In [28]:
#joining multiple lists
lst1 = ["My","name","is","nikhil","garg"]
lst2 = [2,4,8,9,6]

list(zip(lst1,lst2)) #tuple inside list

[('My', 2), ('name', 4), ('is', 8), ('nikhil', 9), ('garg', 6)]

In [29]:
#convert multiple list into dataframe

lst1 = ["My","name","is","nikhil","garg"]
lst2 = [2,4,5,6,7]

df = pd.DataFrame(list(zip(lst1,lst2)),columns=["Details","Val"])
df

  Details  Val
0      My    2
1    name    4
2      is    5
3  nikhil    6
4    garg    7

In [30]:
#converting list of list (multidimensional) into dataframe
lst = [['nikhil',36],['rupail',30],["deep",28],["prithvish",35]]
df = pd.DataFrame(lst,columns=["Name","Age"])
df

        Name  Age
0     nikhil   36
1     rupail   30
2       deep   28
3  prithvish   35

In [31]:
import pandas as pd

In [32]:
titanic = pd.read_csv("titanic.csv")
titanic

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [33]:
titanic.shape

(1309, 14)

In [34]:
titanic.head()
# print default top 5 rows

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [35]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [36]:
titanic.tail()
# print default bottom 5 rows

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [37]:
titanic.tail(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.225,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.875,NaN,S,NaN,NaN,NaN

In [38]:
#exploration of categorical columns
titanic["pclass"].unique()

array([1, 2, 3])

In [39]:
#summary of dataframe
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   pclass     1309 non-null   int64
 1   survived   1309 non-null   int64
 2   name       1309 non-null   object
 3   sex        1309 non-null   object
 4   age        1046 non-null   float64
 5   sibsp      1309 non-null   int64
 6   parch      1309 non-null   int64
 7   ticket     1309 non-null   object
 8   fare       1308 non-null   float64
 9   cabin      295 non-null    object
 10  embarked   1307 non-null   object
 11  boat       486 non-null    object
 12  body       121 non-null    float64
 13  home.dest  745 non-null    object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [40]:
ages = titanic[['age']]
ages.head()

     age
0  29.00
1   0.92
2   2.00
3  30.00
4  25.00

In [41]:
type(ages)

pandas.core.frame.DataFrame

In [42]:
ages.shape

(1309, 1)

In [43]:
age_sex = titanic[["age","sex"]]
age_sex.head()

     age     sex
0  29.00  female
1   0.92    male
2   2.00  female
3  30.00    male
4  25.00  female

In [44]:
age_sex.shape

(1309, 2)

In [45]:
type(age_sex)

pandas.core.frame.DataFrame

### Filter row based on some condition

In [46]:
titanic[titanic["age"]>35]

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [47]:
above_35=titanic[titanic["age"]>35]
above_35

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
6,1,1,"Andrews, Miss. Kornelia Theodosia",female,63.0,1,0,13502,77.9583,D7,S,10,NaN,"Hudson, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
9,1,0,"Artagaveytia, Mr. Ramon",male,71.0,0,0,PC 17609,49.5042,NaN,C,NaN,22.0,"Montevideo, Uruguay"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [48]:
above_35=titanic[(titanic["age"]> 35) & (titanic["age"] <60 )]
above_35

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
10,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [49]:
above_35.reset_index()

,index,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,5,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
1,7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
2,8,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
3,10,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
4,17,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
277,1286,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
278,1287,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
279,1290,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
280,1298,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
281,1301,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [50]:
above_35.reset_index().drop("index",axis=1)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Anderson, Mr. Harry",male,48.0,0,0,19952,26.5500,E12,S,3,NaN,"New York, NY"
1,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0000,A36,S,NaN,NaN,"Belfast, NI"
2,1,1,"Appleton, Mrs. Edward Dale (Charlotte Lamson)",female,53.0,2,0,11769,51.4792,C101,S,D,NaN,"Bayside, Queens, NY"
3,1,0,"Astor, Col. John Jacob",male,47.0,1,0,PC 17757,227.5250,C62 C64,C,NaN,124.0,"New York, NY"
4,1,1,"Baxter, Mrs. James (Helene DeLaudeniere Chaput)",female,50.0,0,1,PC 17558,247.5208,B58 B60,C,6,NaN,"Montreal, PQ"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
277,3,1,"Whabee, Mrs. George Joseph (Shawneene Abi-Saab)",female,38.0,0,0,2688,7.2292,NaN,C,C,NaN,NaN
278,3,0,"Widegren, Mr. Carl/Charles Peter",male,51.0,0,0,347064,7.7500,NaN,S,NaN,NaN,NaN
279,3,1,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S,NaN,NaN,NaN
280,3,0,"Wittevrongel, Mr. Camille",male,36.0,0,0,345771,9.5000,NaN,S,NaN,NaN,NaN
281,3,0,"Youseff, Mr. Gerious",male,45.5,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN

In [51]:
pclass_23=titanic[(titanic["pclass"]==2) | (titanic["pclass"]==3)]
pclass_23

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
323,2,0,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C,NaN,NaN,"Russia New York, NY"
324,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,10,NaN,"Russia New York, NY"
325,2,0,"Aldworth, Mr. Charles Augustus",male,30.0,0,0,248744,13.0000,NaN,S,NaN,NaN,"Bryn Mawr, PA, USA"
326,2,0,"Andrew, Mr. Edgardo Samuel",male,18.0,0,0,231945,11.5000,NaN,S,NaN,NaN,"Buenos Aires, Argentina / New Jersey, NJ"
327,2,0,"Andrew, Mr. Frank Thomas",male,25.0,0,0,C.A. 34050,10.5000,NaN,S,NaN,NaN,"Cornwall, England Houghton, MI"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [52]:
#isin #pclass: 1,2,3 (categorical)
#whether each element in the dataframe is contained in value
#passengers from cabin class 2 and 3

class_23 = titanic[titanic["pclass"].isin([2,3])]
class_23

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
323,2,0,"Abelson, Mr. Samuel",male,30.0,1,0,P/PP 3381,24.0000,NaN,C,NaN,NaN,"Russia New York, NY"
324,2,1,"Abelson, Mrs. Samuel (Hannah Wizosky)",female,28.0,1,0,P/PP 3381,24.0000,NaN,C,10,NaN,"Russia New York, NY"
325,2,0,"Aldworth, Mr. Charles Augustus",male,30.0,0,0,248744,13.0000,NaN,S,NaN,NaN,"Bryn Mawr, PA, USA"
326,2,0,"Andrew, Mr. Edgardo Samuel",male,18.0,0,0,231945,11.5000,NaN,S,NaN,NaN,"Buenos Aires, Argentina / New Jersey, NJ"
327,2,0,"Andrew, Mr. Frank Thomas",male,25.0,0,0,C.A. 34050,10.5000,NaN,S,NaN,NaN,"Cornwall, England Houghton, MI"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1304,3,0,"Zabour, Miss. Hileni",female,14.5,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1305,3,0,"Zabour, Miss. Thamine",female,NaN,1,0,2665,14.4542,NaN,C,NaN,NaN,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.5,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.0,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.0,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [53]:
titanic.dropna(subset="age") # same as below code (but dropna is more used)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1301,3,0,"Youseff, Mr. Gerious",male,45.50,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

In [54]:
# notna #i want to work with passenger data for which age is known
#notna is a boolean inverse of isna
age_no_na = titanic[titanic["age"].notna()]
age_no_na

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.00,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.00,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1301,3,0,"Youseff, Mr. Gerious",male,45.50,0,0,2628,7.2250,NaN,C,NaN,312.0,NaN
1304,3,0,"Zabour, Miss. Hileni",female,14.50,1,0,2665,14.4542,NaN,C,NaN,328.0,NaN
1306,3,0,"Zakarian, Mr. Mapriededer",male,26.50,0,0,2656,7.2250,NaN,C,NaN,304.0,NaN
1307,3,0,"Zakarian, Mr. Ortin",male,27.00,0,0,2670,7.2250,NaN,C,NaN,NaN,NaN
1308,3,0,"Zimmerman, Mr. Leo",male,29.00,0,0,315082,7.8750,NaN,S,NaN,NaN,NaN

### Fetching rows and columns (Slicing)

1. fetch the row and columns on the basis of index positions: iloc
2. fetch the rows and columns on the basis of labels(row as well as column labels):loc

In [55]:
import pandas as pd

In [56]:
brics = pd.read_csv("brics.csv",index_col=0)
brics

           country    capital    area  population
Code
BR          Brazil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

In [57]:
brics.shape

(5, 4)

In [58]:
brics.loc[["RU"]]# RU is the row label of second row

     country capital  area  population
Code
RU    Russia  Moscow  17.1       143.5

In [59]:
brics.loc[["RU","IN","SA"]]

           country    capital    area  population
Code
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
SA    South Africa   Pretoria   1.221       52.98

In [60]:
# select both row and column [row,columns]
brics.loc[["RU","IN","SA"],["country","capital"]]

           country    capital
Code
RU          Russia     Moscow
IN           India  New Delhi
SA    South Africa   Pretoria

In [61]:
brics.loc[:,["country","capital"]]

           country    capital
Code
BR          Brazil   Brasilia
RU          Russia     Moscow
IN           India  New Delhi
CH           China    Beijing
SA    South Africa   Pretoria

In [62]:
brics.loc[["RU","IN","SA"],:]

           country    capital    area  population
Code
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
SA    South Africa   Pretoria   1.221       52.98

In [63]:
brics.iloc[[0,1,2],[0,1]]

     country    capital
Code
BR    Brazil   Brasilia
RU    Russia     Moscow
IN     India  New Delhi

In [64]:
brics.iloc[:,[2,3]]

        area  population
Code
BR     8.516      200.40
RU    17.100      143.50
IN     3.286     1252.00
CH     9.597     1357.00
SA     1.221       52.98

In [65]:
brics.iloc[[3,4],:]

           country   capital   area  population
Code
CH           China   Beijing  9.597     1357.00
SA    South Africa  Pretoria  1.221       52.98

In [67]:
brics.duplicated()

Code
BR    False
RU    False
IN    False
CH    False
SA    False
dtype: bool

In [69]:
df = pd.DataFrame({"brand":['yum','yum','ind'],
                   "style":['cup','cup','bottle']})
df

  brand   style
0   yum     cup
1   yum     cup
2   ind  bottle

In [70]:
df.duplicated()

0    False
1     True
2    False
dtype: bool

In [71]:
df.drop_duplicates()

  brand   style
0   yum     cup
2   ind  bottle

In [72]:
df = pd.DataFrame({"brand":['yum','yum','ind'],
                   "style":['cup','bottle','bottle']})
df

  brand   style
0   yum     cup
1   yum  bottle
2   ind  bottle

In [73]:
df.duplicated()

0    False
1    False
2    False
dtype: bool

In [74]:
df.drop_duplicates(subset="brand")

  brand   style
0   yum     cup
2   ind  bottle

In [79]:
df.drop_duplicates(subset="brand").reset_index()

   index brand   style
0      0   yum     cup
1      2   ind  bottle

In [75]:
brics

           country    capital    area  population
Code
BR          Brazil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

In [ ]:
brics.loc["BR","country"]="brasil"   # not majorly used

In [78]:
brics

           country    capital    area  population
Code
BR          brasil   Brasilia   8.516      200.40
RU          Russia     Moscow  17.100      143.50
IN           India  New Delhi   3.286     1252.00
CH           China    Beijing   9.597     1357.00
SA    South Africa   Pretoria   1.221       52.98

### How to create new columns derived from existing columns

In [80]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"

In [ ]:
titanic["fare"] = titanic["fare"] /10
# modification done in existing column

In [ ]:
titanic['modified_fare'] = titanic["fare"] /10
# generate new column

In [82]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",21.13375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",15.15500

In [84]:
# renaming of columns
titanic_rename = titanic.rename(columns={"sex":"gender","name":"full name"})
titanic_rename.head(2)

,pclass,survived,full name,gender,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",21.13375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",15.15500

In [85]:
titanic.head(2)

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,modified_fare
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",21.13375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",15.15500

In [87]:
titanic_rename.rename(columns= str.upper,inplace=True)  # inplace mean data save without using any variable
titanic_rename.head(2)

,PCLASS,SURVIVED,FULL NAME,GENDER,AGE,SIBSP,PARCH,TICKET,FARE,CABIN,EMBARKED,BOAT,BODY,HOME.DEST,MODIFIED_FARE
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.00,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",21.13375
1,1,1,"Allison, Master. Hudson Trevor",male,0.92,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",15.15500

## Statistical Exploration on Dataframe

Done by data visualization and
statistical analysis

Descriptive statistics i.e. basic statistical metrics

10,15,20,30,45,50,63

mean(average) = sum of all observations
median = centre most value in a sorted data = 30
mode = most occuring item-categorical column
min
max
count

In [88]:
titanic[["age","fare"]].mean()

age     29.881138
fare    33.295479
dtype: float64

In [89]:
titanic[["age","fare"]].median()

age     28.0000
fare    14.4542
dtype: float64

In [ ]:
titanic[["age","fare"]].describe() # continous column

               age         fare
count  1046.000000  1308.000000
mean     29.881138    33.295479
std      14.413493    51.758668
min       0.170000     0.000000
25%      21.000000     7.895800
50%      28.000000    14.454200
75%      39.000000    31.275000
max      80.000000   512.329200

In [ ]:
titanic["sex"].describe() # categorical column

count     1309
unique       2
top       male
freq       843
Name: sex, dtype: object

In [92]:
titanic.describe()

,pclass,survived,age,sibsp,parch,fare,body,modified_fare
count,1309.000000,1309.000000,1046.000000,1309.000000,1309.000000,1308.000000,121.000000,1308.000000
mean,2.294882,0.381971,29.881138,0.498854,0.385027,33.295479,160.809917,3.329548
std,0.837836,0.486055,14.413493,1.041658,0.865560,51.758668,97.696922,5.175867
min,1.000000,0.000000,0.170000,0.000000,0.000000,0.000000,1.000000,0.000000
25%,2.000000,0.000000,21.000000,0.000000,0.000000,7.895800,72.000000,0.789580
50%,3.000000,0.000000,28.000000,0.000000,0.000000,14.454200,155.000000,1.445420
75%,3.000000,1.000000,39.000000,1.000000,0.000000,31.275000,256.000000,3.127500
max,3.000000,1.000000,80.000000,8.000000,9.000000,512.329200,328.000000,51.232920

In [ ]:
titanic.agg({"age":["count","min","max","mean"],"fare":['min','max','median']})
# agg - aggregate

                age      fare
count   1046.000000       NaN
min        0.170000    0.0000
max       80.000000  512.3292
mean      29.881138       NaN
median          NaN   14.4542

In [ ]:
#what  is the average age for male vs female titanic passenger?
#sex and age #mean
#aggregate statisctics grouped the category: sex
#groupby

In [94]:
titanic[['sex','age']].groupby('sex').mean()

              age
sex
female  28.687088
male    30.585228

In [95]:
titanic.groupby('sex') [['age']].mean()

              age
sex
female  28.687088
male    30.585228

In [97]:
titanic.groupby('pclass')[['fare']].mean()

             fare
pclass
1       87.508992
2       21.179196
3       13.302889

In [101]:
titanic.groupby(['sex','pclass'])[['fare']].mean() # the column which has less categorical entry put first example sex first then pclass

                     fare
sex    pclass
female 1       109.412385
       2        23.234827
       3        15.324250
male   1        69.888385
       2        19.904946
       3        12.415462

In [104]:
titanic.groupby(['sex','pclass']) [['age','fare']].mean()

                     age        fare
sex    pclass
female 1       37.037594  109.412385
       2       27.499223   23.234827
       3       22.185329   15.324250
male   1       41.029272   69.888385
       2       30.815380   19.904946
       3       25.962264   12.415462

In [105]:
titanic.groupby(['sex','pclass']).agg({'fare':['mean','median'],'age':['mean','min']})

                     fare                  age
                     mean    median       mean   min
sex    pclass
female 1       109.412385  80.92915  37.037594  2.00
       2        23.234827  23.00000  27.499223  0.92
       3        15.324250  10.48960  22.185329  0.17
male   1        69.888385  49.50420  41.029272  0.92
       2        19.904946  13.00000  30.815380  0.67
       3        12.415462   7.89580  25.962264  0.33